src/Catalogs/Помещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Помещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтображатьВРасписанииЗанятий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Comment>Цвет фона помещения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Помещения/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка на правельность принадлежности структурной единицы в иерархии
	Если СтруктурнаяЕдиница <> Родитель.СтруктурнаяЕдиница И Не Родитель.Пустая() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка - Клиника помещения должна совпадать с клиникой группы помещений!");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Родитель") И Не ДанныеЗаполнения.Родитель.СтруктурнаяЕдиница.Пустая() Тогда
			СтруктурнаяЕдиница = ДанныеЗаполнения.Родитель.СтруктурнаяЕдиница;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("СтруктурнаяЕдиница") Тогда	
			Если ТипЗнч(ДанныеЗаполнения.СтруктурнаяЕдиница) = Тип("Массив") Тогда
				
				Если ДанныеЗаполнения.СтруктурнаяЕдиница.Количество() > 0 Тогда
					
					СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница[0];
					
				КонецЕсли;
				
			ИначеЕсли Не ДанныеЗаполнения.СтруктурнаяЕдиница.Пустая() Тогда
				
				СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;	
				
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктурнаяЕдиница.Пустая() Тогда
			
			СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	КодСинхронизации = "";
КонецПроцедуры

#КонецОбласти
